------------------------------------------------------------
-- 1. Написать запрос получение всех продуктов с типом "СЫР"
------------------------------------------------------------
SELECT * FROM product
WHERE type_id = 
(
  SELECT type_id FROM type
  WHERE type_name = 'СЫР'
);


-----------------------------------------------
-- 2. Написать запрос получения всех продуктов,
-- у кого в имени есть слово "мороженное"
-----------------------------------------------
SELECT * FROM product
WHERE prod_name LIKE '%мороженное%';

---------------------------------------------------------
-- 3. Написать запрос, который выводит все продукты,
-- срок годности которых заканчивается в следующем месяце
---------------------------------------------------------
SELECT * FROM product
WHERE date_part('month', expired_date) = 
date_part('month', current_date) + 1;

----------------------------------------------------------
-- 4. Написать запрос, который вывод самый дорогой продукт
----------------------------------------------------------
SELECT * FROM product
WHERE prod_price =
(
  SELECT MAX(prod_price) FROM product
);

-------------------------------------------------
-- 5. Написать запрос, который выводит количество
-- всех продуктов определенного типа.
-------------------------------------------------
SELECT type_name, COUNT(*) AS num_prods
FROM type, product
WHERE product.type_id = type.type_id
GROUP BY type_name;

-----------------------------------------------------------------------
-- 6. Написать запрос получение всех продуктов с типом "СЫР" и "МОЛОКО"
-----------------------------------------------------------------------
SELECT * FROM product
WHERE type_id IN 
(
  SELECT type_id FROM type
  WHERE type_name IN ('СЫР', 'МОЛОКО')
);

-----------------------------------------------------
-- 7. Написать запрос, который выводит тип продуктов,
-- которых осталось меньше 10 штук
-----------------------------------------------------
SELECT type_name, COUNT(*) AS num_prods
FROM type, product
WHERE product.type_id = type.type_id
GROUP BY type_name
HAVING COUNT(*) < 10;

-----------------------------------
-- 8. Вывести все продукты и их тип
-----------------------------------
SELECT *
FROM product INNER JOIN
(
  SELECT type_name FROM type
) AS prod_type
ON product.type_id =
(
  SELECT type_id FROM type
  WHERE type.type_name = prod_type.type_name  
);